# SteelElemHoleDepthOfBoltHead Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemHoleDepthOfBoltHead Property
ParameterTypeId Class See Also
---
"Depth of bolt head"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemHoleDepthOfBoltHead { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemHoleDepthOfBoltHead As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemHoleDepthOfBoltHead {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace